{
    "topics": [
        "Describe your favorite food.",
        "Write about your daily routine.",
        "Introduce yourself in 5 sentences.",
        "Describe the weather today.",
        "Write a conversation at a restaurant.",
        "List 5 things in your bag and describe them.",
        "Talk about your best friend.",
        "Write a short story using only present tense.",
        "Describe your bedroom.",
        "Write a dialogue at the supermarket.",
        "Write a travel diary entry for a city you visited.",
        "Describe a movie you watched recently.",
        "Write a letter to a pen pal.",
        "Explain how to cook your favorite dish.",
        "Write a review of your favorite book.",
        "Create a job interview conversation.",
        "Write a story using past and future tense.",
        "Summarize a news article in 5 sentences.",
        "Describe your perfect weekend.",
        "Write about a mistake you learned from.",
        "Debate: Should school uniforms be mandatory?",
        "Write an essay about social media and communication.",
        "Describe a historical event in detail.",
        "Write a persuasive letter to your city mayor.",
        "Create a dialogue between two people disagreeing politely.",
        "Write a formal email requesting information.",
        "Explain how climate change affects daily life.",
        "Review two products and compare them.",
        "Write a story that starts with 'It was a quiet morning...'",
        "Analyze a character from your favorite novel.",
        "Invent a new holiday and explain how people celebrate it.",
        "Describe a dream you had.",
        "Create a menu for a fictional restaurant.",
        "Write a poem about your favorite season.",
        "Write a diary entry from the year 2125.",
        "Design a poster for an English club event.",
        "Imagine you are an animal — write about your day.",
        "Describe an invention that would help students.",
        "Write a conversation between two lost tourists.",
        "Summarize your favorite song in English.",
        "Write a story using 10 new vocabulary words.",
        "Create an ad for a new phone.",
        "Describe a superhero you invented.",
        "Write instructions for a simple task (e.g., making tea).",
        "Translate a famous proverb and explain its meaning.",
        "Write a haiku about learning English.",
        "Describe your dream job.",
        "Invent a fictional country and describe its culture.",
        "Explain how to stay motivated while studying English.",
        "Write a scene from a play set in a coffee shop."
    ]
}